<?php
//===============================================================================
//	■定数宣言 よくわからんから後で
//==============================================================================
//---------------------------------------
// □パスワード
//---------------------------------------
define("FIRST_PASS","hit");	//初期ログインの固定パスワード
//---------------------------------------
// □色指定
//---------------------------------------
//define("TOMO_COLOR","b0e0e6");	//他の会員さん用背景色
define("TOMO_COLOR","ffff00");	//他の会員さん用背景色
//define("MY_COLOR","ccfff4");	//マイ背景色
define("MY_COLOR","c0c0c0");	//マイ背景色
//---------------------------------------
// □一覧表示件数
//---------------------------------------
define("LIST_COUNT",5);		//日記記事件数
define("LIST_NEW_COUNT",10);	//最新お料理日記記事の件数
define("LIST_NEW_COUNT2",50);	//最新の地域情報の件数
define("LIST_MSG_COUNT",10);	//メッセージの件数
?>
