<?php
//======================================================================
//  ■：ログアウト画面 logout.php
//======================================================================
//----------------------------------------	
// ■SESSIONを初期化する
//----------------------------------------	
	session_start();		//セッション開始
	unset($_SESSION["my_no"]);		//Sessionの初期化
?>
<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=utf-8">
<title>ログアウト</title>
</head>
<body>
<h3>研究用SNSからログアウトしました</h3>
<a href="./login.php">ログイン</a>はこちらから
</body>
</html>